Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4e/include/sam4e16e.h
/**
 * \file
 *
 * Copyright (c) 2013-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */
/*
 * Support and FAQ: visit <a href="https://www.microchip.com/support/">Microchip Support</a>
 */

#ifndef _SAM4E16E_
#define _SAM4E16E_

/** \addtogroup SAM4E16E_definitions SAM4E16E definitions
  This file defines all structures and symbols for SAM4E16E:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif 

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#include <stdint.h>
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAM4E16E */
/* ************************************************************************** */
/** \addtogroup SAM4E16E_cmsis CMSIS Definitions */
/*@{*/

/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M4 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M4 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M4 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M4 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M4 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M4 System Tick Interrupt       */
/******  SAM4E16E specific Interrupt Numbers *********************************/
  
  SUPC_IRQn            =  0, /**<  0 SAM4E16E Supply Controller (SUPC) */
  RSTC_IRQn            =  1, /**<  1 SAM4E16E Reset Controller (RSTC) */
  RTC_IRQn             =  2, /**<  2 SAM4E16E Real Time Clock (RTC) */
  RTT_IRQn             =  3, /**<  3 SAM4E16E Real Time Timer (RTT) */
  WDT_IRQn             =  4, /**<  4 SAM4E16E Watchdog/Dual Watchdog Timer (WDT) */
  PMC_IRQn             =  5, /**<  5 SAM4E16E Power Management Controller (PMC) */
  EFC_IRQn             =  6, /**<  6 SAM4E16E Enhanced Embedded Flash Controller (EFC) */
  UART0_IRQn           =  7, /**<  7 SAM4E16E UART 0 (UART0) */
  PIOA_IRQn            =  9, /**<  9 SAM4E16E Parallel I/O Controller A (PIOA) */
  PIOB_IRQn            = 10, /**< 10 SAM4E16E Parallel I/O Controller B (PIOB) */
  PIOC_IRQn            = 11, /**< 11 SAM4E16E Parallel I/O Controller C (PIOC) */
  PIOD_IRQn            = 12, /**< 12 SAM4E16E Parallel I/O Controller D (PIOD) */
  PIOE_IRQn            = 13, /**< 13 SAM4E16E Parallel I/O Controller E (PIOE) */
  USART0_IRQn          = 14, /**< 14 SAM4E16E USART 0 (USART0) */
  USART1_IRQn          = 15, /**< 15 SAM4E16E USART 1 (USART1) */
  HSMCI_IRQn           = 16, /**< 16 SAM4E16E Multimedia Card Interface (HSMCI) */
  TWI0_IRQn            = 17, /**< 17 SAM4E16E Two Wire Interface 0 (TWI0) */
  TWI1_IRQn            = 18, /**< 18 SAM4E16E Two Wire Interface 1 (TWI1) */
  SPI_IRQn             = 19, /**< 19 SAM4E16E Serial Peripheral Interface (SPI) */
  DMAC_IRQn            = 20, /**< 20 SAM4E16E DMAC (DMAC) */
  TC0_IRQn             = 21, /**< 21 SAM4E16E Timer/Counter 0 (TC0) */
  TC1_IRQn             = 22, /**< 22 SAM4E16E Timer/Counter 1 (TC1) */
  TC2_IRQn             = 23, /**< 23 SAM4E16E Timer/Counter 2 (TC2) */
  TC3_IRQn             = 24, /**< 24 SAM4E16E Timer/Counter 3 (TC3) */
  TC4_IRQn             = 25, /**< 25 SAM4E16E Timer/Counter 4 (TC4) */
  TC5_IRQn             = 26, /**< 26 SAM4E16E Timer/Counter 5 (TC5) */
  TC6_IRQn             = 27, /**< 27 SAM4E16E Timer/Counter 6 (TC6) */
  TC7_IRQn             = 28, /**< 28 SAM4E16E Timer/Counter 7 (TC7) */
  TC8_IRQn             = 29, /**< 29 SAM4E16E Timer/Counter 8 (TC8) */
  AFEC0_IRQn           = 30, /**< 30 SAM4E16E Analog Front End 0 (AFEC0) */
  AFEC1_IRQn           = 31, /**< 31 SAM4E16E Analog Front End 1 (AFEC1) */
  DACC_IRQn            = 32, /**< 32 SAM4E16E Digital To Analog Converter (DACC) */
  ACC_IRQn             = 33, /**< 33 SAM4E16E Analog Comparator (ACC) */
  ARM_IRQn             = 34, /**< 34 SAM4E16E FPU signals : FPIXC, FPOFC, FPUFC, FPIOC, FPDZC, FPIDC, FPIXC (ARM) */
  UDP_IRQn             = 35, /**< 35 SAM4E16E USB DEVICE (UDP) */
  PWM_IRQn             = 36, /**< 36 SAM4E16E PWM (PWM) */
  CAN0_IRQn            = 37, /**< 37 SAM4E16E CAN0 (CAN0) */
  CAN1_IRQn            = 38, /**< 38 SAM4E16E CAN1 (CAN1) */
  AES_IRQn             = 39, /**< 39 SAM4E16E AES (AES) */
  GMAC_IRQn            = 44, /**< 44 SAM4E16E EMAC (GMAC) */
  UART1_IRQn           = 45, /**< 45 SAM4E16E UART (UART1) */

  PERIPH_COUNT_IRQn    = 46  /**< Number of peripheral IDs */
} IRQn_Type;

